#a = str(input("введите слова: ")).split()
#b = list(set(a))
#print(b)

# a = str(input("введите слова: ")).split()
# b = max(a,key=len)
# print(b)


# flag = True
# while flag :
#     word = input('введите ник: ')

#     if word == 'HIIrOO' : 
#         flag = False 
#         print ('Привествую, любезный ', word )
#     else : 
#         print('Тут ничего нет . Есть еще вопросы ?')



# 2) Напишите программу которая будет выводить сумму натуральных чисел с оператором if и циклом while.


# a = True
# sum = 0
# while a :
#     number = int(input("Введите число: "))
#     if number <= 0  : 
#         a = False 
#         print (sum)
#     sum += number    

# 3 Напишите программу которая будет перебирать словарь (dict) и выводить его значения (value) 



# Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].

# Выведите все элементы, которые меньше 5.
# Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].

# Выведите все элементы, которые меньше 5.

# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]

# for i in range(len(a)):

#    if a[i] < 5:

#        print(a[i])



# a = int(input('введите время : '))
# if a <= 12 :
   
#    print('GM')
# elif a <= 18 :
     
#     print('HGD')
# elif  a <= 21 :
    
#     print('GE')
# elif a<= 24 :
#     print('GN')



# number = int(input("Введите число: "))

# number2 = int(input("Введите число: "))

# number3 = int(input("Введите число: "))
# b = max(number , number2 , number3)

# print("max :", b)




# a = int(input('enter num '))
# c = 0 
# for b in range(1 , a + 1 ) : 
#     c += b 

# print(c)
# b = 0 
# a = 0 
# with open('text.txt', 'r') as file :
#     text = file.read().split()
# num = float(int(list(text)))
# b += num 
# a += 1 
# c = b/a
# print (c)

# with open("file.txt","r") as file, open("file2.txt","r") as file2:
#     text = file.read(),file2.read()
    

# with open("file3.txt","w") as file3: 
#    file3.write()
# for text in file3 : 
#     pass